OpenAtomFoundation/TobudOS/platform/vendor_bsp/Nuvoton/Nuvoton_M251/StdDriver/src/clk.c
    case (CLK_PCLKDIV_APB1DIV_DIV32):
        return SystemCoreClock >> 5;

    default:
        return 0UL;
    }
}

/**
  * @brief      Get HCLK frequency
  * @param      None
  * @return     HCLK frequency
  * @details    This function get HCLK frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetHCLKFreq(void)
{
    SystemCoreClockUpdate();
    return SystemCoreClock;
}

/**
  * @brief      Get CPU frequency
  * @param      None
  * @return     CPU frequency
  * @details    This function get CPU frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetCPUFreq(void)
{
    SystemCoreClockUpdate();
    return SystemCoreClock;
}

/**
 * @brief    Get PLL Clock Output Frequency
 *
 * @param    None
 *
 * @return   PLL clock output frequency
 *
 * @details  To get actual PLL clock output frequency. The clock uint is in Hz.
 */
uint32_t CLK_GetPLLClockFreq(void)
{
    uint32_t u32PllFreq;
    uint32_t u32FIN, u32NF, u32NR, u32NO;
    uint8_t au8NoTbl[4] = {1u, 2u, 4u, 4u}; /* OUT_DV :DEF: {1, 2, 4, 4} */
    uint32_t u32Reg;

    u32PllFreq = 0UL;
    u32Reg = CLK->PLLCTL;

    if ((u32Reg & (CLK_PLLCTL_PD_Msk | CLK_PLLCTL_OE_Msk)) == 0)
    {
        /* PLL is enabled and output enabled */
        if (u32Reg & CLK_PLLCTL_PLLSRC_Msk)
        {
            if ((u32Reg & CLK_PLLCTL_PLLSRC_Msk) == CLK_PLLCTL_PLLSRC_MIRC)
                u32FIN = __MIRC;
            else
                u32FIN = (__HIRC >> 2);
        }
        else
            u32FIN = __HXT;

        if (u32Reg & CLK_PLLCTL_BP_Msk)
        {
            /* PLL is in bypass mode */
            u32PllFreq = u32FIN;
        }
        else
        {
            /* PLL is in normal work mode */
            u32NO = au8NoTbl[((u32Reg & CLK_PLLCTL_OUTDIV_Msk) >> CLK_PLLCTL_OUTDIV_Pos)];
            u32NF  = ((u32Reg & CLK_PLLCTL_FBDIV_Msk) >> CLK_PLLCTL_FBDIV_Pos);
            u32NR  = ((u32Reg & CLK_PLLCTL_INDIV_Msk) >> CLK_PLLCTL_INDIV_Pos);
            /* u32FIN is shifted 2 bits to avoid overflow */
            u32PllFreq = (((u32FIN >> 2) * u32NF) / (u32NR * u32NO) << 2);
        }
    }

    return u32PllFreq;
}

/**
  * @brief      Disable PLL
  * @param      None
  * @return     None
  * @details    This function set PLL in Power-down mode. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisablePLL(void)
{
    CLK->PLLCTL |= CLK_PLLCTL_PD_Msk;
}

/**
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_PLLCTL_PLLSRC_HXT
  *             - \ref CLK_PLLCTL_PLLSRC_HIRC_DIV4
  *             - \ref CLK_PLLCTL_PLLSRC_MIRC
  * @param[in]  u32PllFreq is PLL frequency.
  * @return     PLL frequency
  * @details    This function is used to configure PLLCTL register to set specified PLL frequency. \n
  *             The register write-protection function should be disabled before using this function.
  *             The PLL output is least 16MHz at least if BP(CLK_PLLCTL[17]) is not set.
  */
uint32_t CLK_EnablePLL(uint32_t u32PllClkSrc, uint32_t u32PllFreq)
{
    uint32_t u32PllSrcClk, u32NR, u32NF, u32NO, u32ClkSrc;
    uint32_t u32Tmp, u32Tmp2, u32Tmp3, u32Min, u32MinNF, u32MinNR, u32MinNO, u32PllBassFreq;

    /* Disable PLL first to avoid unstable when setting PLL */
    CLK_DisablePLL();

    /* PLL source clock is from HXT */
    if (u32PllClkSrc == CLK_PLLCTL_PLLSRC_HXT)
    {
        /* Enable HXT clock */
        CLK->PWRCTL = (CLK->PWRCTL & ~CLK_PWRCTL_HXTEN_Msk) | CLK_PWRCTL_HXTEN_Msk;

        /* Wait for HXT clock ready */
        CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

        /* Select PLL source clock from HXT */
        u32ClkSrc = CLK_PLLCTL_PLLSRC_HXT;
        u32PllSrcClk = __HXT;//12 MHz
    }
    /* PLL source clock is from HIRC_DIV4 */
    else if (u32PllClkSrc == CLK_PLLCTL_PLLSRC_HIRC_DIV4)
    {
        /* Enable HIRC clock */
        CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;
        /* Enable MIRC clock */
        CLK->PWRCTL |= CLK_PWRCTL_MIRCEN_Msk;

        /* Wait for HIRC clock ready */
        CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);
        /* Wait for MIRC clock ready */
        CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);

        /* Select PLL source clock from HIRC_DIV4 */
        u32ClkSrc = CLK_PLLCTL_PLLSRC_HIRC_DIV4;
        u32PllSrcClk = (__HIRC >> 2); //12 MHz
    }
    else
    {
        /* Enable MIRC clock */
        CLK->PWRCTL |= CLK_PWRCTL_MIRCEN_Msk;
        /* Enable HIRC clock */
        CLK->PWRCTL |= CLK_PWRCTL_HIRCEN_Msk;

        /* Wait for MIRC clock ready */
        CLK_WaitClockReady(CLK_STATUS_MIRCSTB_Msk);
        /* Wait for HIRC clock ready */
        CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

        /* Select PLL source clock from MIRC */
        u32ClkSrc = CLK_PLLCTL_PLLSRC_MIRC;
        u32PllSrcClk = __MIRC;//4 MHz
    }

    if ((u32PllFreq <= FREQ_100MHZ) && (u32PllFreq >= FREQ_16MHZ))
    {
        /* Find best solution */
        u32Min = (uint32_t) - 1UL;
        u32MinNR = 0UL;
        u32MinNF = 0UL;
        u32MinNO = 0UL;
        u32PllBassFreq = u32PllFreq;

        for (u32NO = 0UL; u32NO <= 3UL; u32NO++)
        {
            /* Break when get good results */
            if (u32Min == 0UL)
                break;

            if (u32NO != 2UL)
            {
                if (u32NO == 3UL)
                {
                    u32PllFreq = u32PllBassFreq << 2;
                }
                else if (u32NO == 1UL)
                {
                    u32PllFreq = u32PllBassFreq << 1;
                }
                else
                {
                }

                for (u32NR = 1UL; u32NR <= 6UL; u32NR++)   //u32PllSrcClk: MIRC:4M, HIRC_DIV4:12M, HXT:4~24M, 4 MHz <= u32Tmp
                {
                    u32Tmp = u32PllSrcClk / u32NR;

                    if (u32Tmp >= FREQ_4MHZ && u32Tmp <= FREQ_8MHZ)  //4 MHz <= u32Tmp <= 8 MHz
                    {
                        for (u32NF = 8UL; u32NF <= 25UL; u32NF++)  //4 MHz <= u32Tmp, u32Tmp2 <= FREQ_100MHZ
                        {
                            u32Tmp2 = u32Tmp * u32NF;

